__author__ = "Высоцкая И.Д."
'Модуль с тестами'

from func_ex178b import * # подключаем модуль с функциями
import pytest

def test():
    """Функция с тестами"""
    assert count_ch([1,2,3,4,5],3,5) == 1
    assert count_ch([3,15,18],3,5) == 2 # какие-то кратны 3 и не кратны 5
    assert count_ch([5, 15, 20],3,5) == 0 # все кратны 5
    assert count_ch([3, 21, 18],3,5) == 3 # все кратны 3 и не кратны 5
    assert count_ch([3],3,5) == 1 # один элемент кратный 3 и не кратный 5
    assert count_ch([2,4,8,14,18],2,7) == 4